Repository: ThierryDeruyttere/Proj-Database
Catalog: codegalaxy/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Challenges
nl: Uitdagingen

source: Search opponent
nl: Zoek tegenstander

source: Active
nl: Actief

source: Finished
nl: Afgerond

source: Requests
nl: Aanvragen

source: You have no active challenges...
nl: Je hebt geen lopende uitdagingen...

source: You have no completed challenges...
nl: Je hebt nog geen uitdagingen afgemaakt...

source: You have no challenge requests...
nl: Je hebt geen uitdagingsverzoeken...

source: So we meet again space voyager! Do you remember me? It's me grub!
nl: We ontmoeten elkaar weer reiziger! Herinner je me? Het is grub!

source: Oh boy! Seems you are going to challenge somebody! By challenging and defeating someone you become stronger! Ah, brings back some old memories. In the bootloader galaxy I was known as Grub The Destroyer! If i'd get mad I could just destroy a whole planet!
nl: Het ziet er naar uit dat je iemand gaat uitdagen. Door mensen uit te dagen en te verslaan zal je sterker worden! Ah, die goede oude tijd. In het Bootloader stelsel was ik gekend als Grub The Destroyer! Als ik kwaad werd kon ik een hele planeet vernietigen!

source: Okay that's a lie, I'm one of the lowest level aliens in the Bootloader galaxy. I always needed someone strong to defend me. Before I got lost in this galaxy, my friend Kernel used to defend me. But since we got separated, I have no one left for protecting me... Will you please defend me? I'm so scared without Kernel...
nl: Ok dat is een leugen, Ik ben een van de laagst gerankte buitenaardse wezens in het bootloader stelsel... I had altijd iemand sterk nodig om me te verdedigen. Voor dat ik in dit melkwegstelsel verloren geraakte was mijn vriend Kernel er altijd om me te beschermen. Maar sinds we gescheiden zijn, heb niemand meer om me te beschermen... Wil jij me beschermen? Ik ben zo bang zonder Kernel...

source: Select challenge:
nl: Selecteer uitdaging:

source: Perfects
nl: Perfect

source: Select list for challenge:
nl: Selecteer lijst voor de uitdaging

source: Challenge!
nl: Daag uit!

source: The 'Score' challenge is a challenge where you need to get the highest score on a list.
nl: De 'Score' uitdaging is een uitdaging waarbij je de hoogste score moet behalen op een lijst.

source: The 'Perfects' challenge is a challenge where you need to have the most questions answered perfectly.
nl: De 'Perfect' uitdaging is een uitdaging waarbij je om ter meeste vragen perfect moet oplossen.

source: Sorry, we couldn't find any lists!
nl: Sorry, we konden geen lijsten vinden!

source: Wins per user
nl: Overwinningen per gebruiker

source: #Challenges per challenge type
nl: #Uitdagingen per uitdagingstype

source: Challenge info...
nl: Uitdagingsinfo...

source: Give up
nl: Geef op

source: Opponent
nl: Tegenstander

source: Challenger
nl: Uitdager

source: Won by default
nl: Is gewonnen

source: Gave up
nl: Heeft het opgegeven

source: Perfects
nl: Perfect

source: Winner
nl: Winnaar

source: Loser
nl: Verliezer

source: Type:
nl: Soort:

source: List:
nl: Lijst:

source: Cancel
nl: Annuleer

source: Invite
nl: Uitnodiging

source: Accept
nl: Accepteer

source: Killed the process.
nl: Het proces beeïndigd

source: Process took longer than expected, so we killed it.
nl: Het proces duurde langer dan verwacht, dus we sloten het af.

source: This is the sandbox area. You can try out pieces of code here and practise your programming skills.
nl: Dit is de zandbak, hier kan je stukken code uitproberen en dus je codeervaardigheden oefenen.

source: Select a programming language above and have fun coding!
nl: Selecteer een programmeertaal hierboven en veel plezier!

source: Clear
nl: Maak leeg

source: Evaluate
nl: Evalueer

source: Success!
nl: Gelukt!

source: Oops, something went wrong...
nl: Oeps, er ging iets mis...

source: No output...
nl: Geen output...

source: Answer
nl: Antwoord

source: This question is part of your own list!
nl: Deze vraag is onderdeel van je eigen lijst!

source: You solved this question!
nl: Je hebt deze vraag opgelost!

source: Return to list
nl: Keer terug naar lijst

source: Edit exercise
nl: Pas oefening aan

source: Create exercise
nl: Creëer oefening

source: Exercise title
nl: Naam oefening

source: Question
nl: Vraag

source: Exercise Type:
nl: Soort oefening:

source: Code question
nl: Code vraag

source: Multiple choice
nl: Meerkeuzevraag

source: Python Turtle Graphics
nl: Python Schildpad Figuren

source: Add translation
nl: Voeg vertaling toe

source: Hi there space voyager! I'm Kernel!
nl: Hallo ruimtereiziger! Ik ben Kernel!

source: I'm from a far away planet named Bootloader.
nl: Ik ben van een planeet ver van hier genaamd Bootloader.

source: I've stumbled upon this site and I really like it and I want to show it to my friends back home!
nl: Ik ben op deze geweldige site terechtgekomen en ik wil hem laten zien aan mijn vrienden thuis!

source: The only problem is, on each planet we speak a different language, so I'm working on translating this site.
nl: Het probleem is dat er op elke planeet een andere taal gesproken wordt, dus ik ben aan vertalingen voor de site aan het werken.

source: Think you could help? I will make your name famous across the universe if you do!
nl: Denk je dat je zou kunnen helpen? Ik zal je beroemd maken over het hele universum als je me me helpt!

source: Original
nl: Origineel

source: Translated
nl: Vertaald

source: Error: You need to at least provide an english translation
nl: Error: je moet een engelse vertaling geven

source: Error: There are translations missing for:
nl: Error: Er ontbreken vertalingen voor:

source: . If you don't want translations for these languages
nl: . Als je geen vertalingen wilt voor deze talen

source: then just remove all the entries for these languages, or fill in the missing translations for these languages
nl: Verwijder dan alle ingevulde delen voor deze talen, of vul de ontbrekende in

source: You need to expect some output!
nl: Je moet wel output verwachten!

source: Edit list
nl: Pas lijst aan

source: Create a new list
nl: Maak een nieuwe lijst

source: 'Enter list name'
nl: 'Vul een naam in voor de lijst'

source: 'Enter description of exercise list'
nl: 'Geef een beschrijving van de oefeningenlijst'

source: Difficulty
nl: Moeilijkheid

source: Programming language
nl: Programmeertaal

source: Subject
nl: Onderwerp

source: Subjects
nl: Onderwerpen

source: Edit
nl: Pas aan

source: Return
nl: Keer terug naar lijst

source: 'Create list'
nl: 'Maak lijst'

source: Translate
nl: Vertaal

source: List name
nl: Lijstnaam

source: Description
nl: Beschrijving

source: Error: You need to atleast provide an english translation
nl: Error: je moet een engelse vertaling geven

source: Error: You need to atleast provide an english title
nl: Error: je moet een engelse titel geven

source: Error: There are translations missing for:
nl: Error: Er ontbreken vertalingen voor:

source: List or exercise name
nl: Naam van lijst of oefening

source: Copy all list
nl: Kopieer alles

source: Import all list
nl: Importeer alles

source: Title
nl: Titel

source: copy original
nl: kopieer originele

source: reference
nl: referentie

source: This list does not contain any exercises.
nl: Deze lijst heeft geen oefeningen.

source: Import
nl: Importeer

source: Confirmation
nl: Bevestig

source: Import!
nl: Importeer!

source: Copy
nl: Kopie

source: It seems like you have been on this planet before.
nl: Het lijkt erop dat je deze planeet al eens bezoekt hebt.

source: Exercises
nl: Oefeningen

source: solved
nl: opgelost

source: Share
nl: Delen

source: Your score
nl: Je score

source: Share my result
nl: Deel mijn resultaat

source: Rating:
nl: Beoordeling:

source: Completed on
nl: Voltooid op

source: Make all exercises of this list to give it a rating!
nl: Maak alle oefeningen van deze lijst om een beoordeling te kunnen geven!

source: Made by
nl: Gecreëerd door

source: Made on
nl: Gecreëerd op

source: Average score
nl: Gemiddelde score

source: Average rating
nl: Gemiddelde beoordeling

source: Users that finished list
nl: Aantal gebruikers die de lijst gemaakt hebben

source: ExerciseLists like this one:
nl: Oefeningenlijsten als deze:

source: Import exercise
nl: Importeer oefening

source: Add exercises to my list
nl: Voeg oefeningen aan mijn lijst toe

source: Import into:
nl: Importeer in:

source: Search exercise lists
nl: Zoek oefeningenlijsten

source: Create new list
nl: Maak een nieuwe lijst

source: Author name
nl: Naam auteur

source: Choose programming language
nl: Kies je programmeertaal

source: Advanced search
nl: Gevorderd zoeken

source: Subjects (separated with a comma)
nl: Onderwerpen (gescheiden met komma)

source: Sort:
nl: Sorteer:

source: Ascending
nl: Stijgend

source: Descending
nl: Dalend

source: Search
nl: Zoeken

source: Difficulty:
nl: Moeilijkheid:

source: Created by:
nl: Gecreëerd door:

source: Exercises:
nl: Oefeningen:

source: Subjects:
nl: Onderwerpen:

source: Explore!
nl: Verken!

source: Planet difficulty min-max: 1 - 5
nl: Moeilijkheid planeet min-max: 1-5

source: Get hint
nl: Gebruik Hint

source: Reset question
nl: Hernieuw de code

source: Select the right answer
nl: Selecteer het correcte antwoord

source: Correct answer
nl: Correct antwoord

source: Code the user gets to see.
nl: Code die de gebruiker te zien krijgt

source: Expected output.
nl: Verwachte output

source: Add Hint
nl: Voeg hint toe

source: Possible answers
nl: Mogelijke antwoorden

source: Correct answer!
nl: Correct antwoord!

source: Wrong answer...
nl: Fout antwoord...

source: Your score:
nl: Je score

source: Your current score:
nl: Je huidige score

source: Your code outputted:
nl: Je code gaf als resultaat:

source: Next exercise
nl: Volgende oefening

source: Try again
nl: Probeer opnieuw

source: Planets/Programming Language
nl: Planeten/Programmeertaal

source: Most Popular Subjects
nl: Meest Populaire Onderwerpen

source: Users who made the most lists
nl: Gebruikers die het meeste lijsten maakten

source: There are no search results to display.
nl: Er zijn geen zoekresultaten om weer te geven.

source: Page not found
nl: Pagina niet gevonden

source: Internal Server Error
nl: Interne Server Error

source: Badge Overview
nl: Overzicht badges

source: Congratulations! You already earned this badge!
nl: Gefeliciteerd! Je hebt deze badge al eens verdiend!

source: earned
nl: verdiend

source: Users that earned this badge:
nl: Aantal gebruikers die deze badge verdiend hebben:

source: No one has earned this badge yet, be the first!
nl: Nog niemand heeft deze badge verdiend, zorg dat jij de eerste bent!

source: How long have you been member of codegalaxy?
nl: Hoe lang ben je al lid van codegalaxy?

source: How many groups are you member of?
nl: Van hoeveel groepen ben je lid?

source: How many friends do you have?
nl: Hoeveel vrienden heb je?

source: How many exercise lists have you solved?
nl: Hoeveel oefeningenreeksen heb je opgelost?

source: How many lists have you created?
nl: Hoeveel oefeningen lijsten heb je gecreeerd?

source: How many people have solved your exercise lists?
nl: Hoeveel mensen hebben een van je oefeningen lijsten opgelost?

source: How many exercise lists have you rated?
nl: Hoeveel oefeningen lijsten heb je beoordeeld?

source: How many consecutive days have you visited?
nl: Hoeveel opeenvolgende dagen heb je onze site bezocht?

source: English
nl: Engels

source: Dutch
nl: Nederlands

source: Owner:
nl: Eigenaar:

source: Members:
nl: Leden:

source: Become member
nl: Word lid

source: Delete Group
nl: Maak groep

source: Leave group
nl: Verlaat groep

source: Feed
nl: Nieuws

source: Members
nl: Leden

source: Messages
nl: Berichten

source: Add New Members
nl: Voeg leden toe

source: became friends with
nl: werd bevriend met

source: was added to group:
nl: werd toegevoegd aan de groep:

source: solved an exercise list:
nl: loste deze oefeningenlijst op:

source: and scored
nl: en behaalde

source: created an exercise list:
nl: creëerde een oefeningenlijst:

source: Upload group picture
nl: Kies een nieuwe groepsfoto

source: Edit Group Picture
nl: Wijzig groepsfoto

source: Post
nl: Schrijf

source: There does not seem to be any posts here yet!
nl: Er zijn hier precies nog geen berichten!

source: Search members to add...
nl: Zoek leden om toe te voegen...

source: Member
nl: Lid

source: Owner
nl: Eigenaar

source: Kick user
nl: Verwijder lid

source: Promote user
nl: Promoveer lid

source: Reply
nl: Antwoord

source: Create a new group
nl: Maak een nieuwe groep

source: Add a name for your new group
nl: Voeg een naam toe voor je groep

source: Group Name
nl: Groepsnaam

source: Name already taken/no name given
nl: Naam al in gebruik/geen naam gegeven

source: Do you want to create a private group?
nl: Wil je de groep prive maken?

source: Private
nl: Prive

source: Create Group
nl: Maak groep

source: Social
nl: Sociaal

source: Create new group
nl: Maak een nieuwe groep

source: Search groups...
nl: Zoek groepen...

source: Show my groups only
nl: Toon enkel mijn groepen

source: Friend requests
nl: Vriendschapsverzoeken

source: Decline
nl: Weiger

source: You have no friend requests
nl: Je hebt geen vriendschapsverzoeken

source: Group requests
nl: Groepsuitnodigingen

source: You have no group invites
nl: Je hebt geen groepsuitnodigingen

source: Biggest Groups
nl: Grootste Groepen

source: My profile
nl: Mijn profiel

source: Sandbox mode
nl: Zandbak modus

source: Explore the galaxy...
nl: Verken het sterrenstelsel...

source: became member of the group:
nl: werd lid van:

source: Recommended Lists:
nl: Aanbevolen lijsten:

source: I'm feeling lucky!
nl: Een gokje wagen!

source: You have made every single exerciselist!
nl: Je hebt elke lijst opgelost!

source: Already a member
nl: Al een gebruiker

source: Incorrect email and/or password.
nl: Ongeldig email en/of paswoord.

source: Email Address
nl: Email adres

source: Enter a valid Email Address.
nl: Vul een gedig email adres in.

source: Password
nl: Paswoord

source: Enter a valid Password.
nl: Vul een geldig paswoord in.

source: Continue journey
nl: Zet je reis verder

source: New member
nl: Nieuwe gebruiker

source: First Name
nl: Voornaam

source: Enter a valid First Name.
nl: Vul een geldige voornaam in.

source: Last Name
nl: Achternaam

source: Enter a valid Last Name.
nl: Vul een geldige achternaam in.

source: Enter a valid password.
nl: Vul een geldig paswoord in.

source: Confirm Password
nl: Bevestig Paswoord

source: The passwords did not match.
nl: De paswoorden komen niet overeen

source: Lift off
nl: Lanceer

source: Log in
nl: Meld je aan

source: See you next time, earthling. What is the phrase you earthlings always use?
nl: Tot de volgende keer, aardbewoner. Wat zeggen jullie zelf altijd?

source: Oh yes. I will miss you, is that right?
nl: Oh ja. Ik zal je missen, is dat juist?

source: Friendship pending
nl: Vriendschap in behandeling

source: Become friends
nl: Word bevriend

source: Remove as friend
nl: Verwijder als vriend

source: Friends
nl: Vrienden

source: Groups
nl: Groepen

source: More
nl: Meer

source: Edit Information
nl: Wijzig informatie

source: wants to be your friend.
nl: wil je vriend worden.

source: Old Password
nl: Oud Paswoord

source: New Password
nl: Nieuw Paswoord

source: Confirm new password
nl: Bevestig nieuw paswoord

source: The passwords don't match.
nl: De wachtwoorden komen niet overeen

source: Update Password
nl: Wijzig Paswoord

source: Upload profile picture
nl: Kies een nieuwe Profielfoto

source: Please select a file.
nl: Selecteer een bestand

source: Edit Profile Picture
nl: Wijzig Profielfoto

source: You have
nl: Je hebt

source: mutual friends
nl: gemeenschappelijke vrienden

source: wants to be your friend, do you want to accept?
nl: wil je vriend worden, accepteer je dit verzoek?

source: Confirm
nl: Bevestig

source: Mutual friends
nl: Gemeenschappelijke vrienden

source: Others
nl: Anderen

source: Someone wants to add you to
nl: Iemand wil je toevoegen aan

source: You have not joined a group yet.
nl: Je bent nog geen lid van een groep.

source: Take a look!
nl: Neem een kijkje!

source: isn't a member of any groups yet.
nl: is nog geen lid van een groep.

source: Earned Badges
nl: Verdiende Badges

source: Lists made per programming language
nl: Lijsten gemaakt per programmeertaal

source: Exercises made per programming language
nl: Oefeningen gemaakt per programmeertaal

source: Total amount of lists made:
nl: Totale aantal oefeningenlijsten gemaakt:

source: You have not completed any exercise lists yet!
nl: Je hebt nog geen oefeningenlijsten afgewerkt!

source: Total amount of groups joined:
nl: Totaal aantal groepen waar je lid bent:

source: Time member of site:
nl: Werd lid van deze website:

source: Last login:
nl: Laatste keer bezocht:

source: Congratulations, you have verified your email
nl: Gefeliciteerd,je email is geverifieerd!
